In [14]:
#Data Preprocessing

#importing libraries
import sklearn
import numpy as np
import pandas as pd
#importing dataset
data=pd.read_csv('Data.csv')
print("Dataset imported")

Dataset imported

In [30]:
df=pd.DataFrame(data)
print(df)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [16]:
#identifying total number of missing values in each column
df.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [23]:
#removing those null values
#There are 2 ways to do this
#1. dropna()
#2.fillna(with some value)

#1. using dropna()
df1=df.copy()
df1=df.dropna()
print("Using dropna()")
print(df1)
#2.using fillna()
df2=df.copy()
df2.fillna(df2.mean(numeric_only=True),inplace=True)
print("using fillna()")
print(df2)
df2.isnull().sum()

Using dropna()
   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes
using fillna()
   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes

Country      0
Age          0
Salary       0
Purchased    0
dtype: int64

In [32]:
#Next step is encoding
# 2 types of encoding
#Label Encoding, Onehot encoder

#The below code is for onehot encoder
df_encoded=pd.get_dummies(df)
print(df_encoded)

    Age   Salary  Country_France  Country_Germany  Country_Spain  \
0  44.0  72000.0            True            False          False
1  27.0  48000.0           False            False           True
2  30.0  54000.0           False             True          False
3  38.0  61000.0           False            False           True
4  40.0      NaN           False             True          False
5  35.0  58000.0            True            False          False
6   NaN  52000.0           False            False           True
7  48.0  79000.0            True            False          False
8  50.0  83000.0           False             True          False
9  37.0  67000.0            True            False          False

   Purchased_No  Purchased_Yes
0          True          False
1         False           True
2          True          False
3          True          False
4         False           True
5         False           True
6          True          False
7         False           True
8          True          False
9         False           True

In [39]:
#split data
from sklearn.model_selection import train_test_split
X=df[['Age', 'Salary', 'Country']]
y=df[['Purchased']]
#70% ttraining, 30% testing
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.3,random_state=42)
print("X_train")
print(X_train)
print("X_test")
print(X_test)
print("y_train")
print(y_train)
print("y_test")
print(y_test)

X_train
    Age   Salary  Country
0  44.0  72000.0   France
7  48.0  79000.0   France
2  30.0  54000.0  Germany
9  37.0  67000.0   France
4  40.0      NaN  Germany
3  38.0  61000.0    Spain
6   NaN  52000.0    Spain
X_test
    Age   Salary  Country
8  50.0  83000.0  Germany
1  27.0  48000.0    Spain
5  35.0  58000.0   France
y_train
  Purchased
0        No
7       Yes
2        No
9       Yes
4       Yes
3        No
6        No
y_test
  Purchased
8        No
1       Yes
5       Yes